logs/rps_sweep/2026-04-01_005939/rps300_bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7dd67e5ead40>, trust_remote_code=False, seed=0, num_prompts=1024, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=128, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=300.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-f480d057-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-01 01:17:49 [datasets.py:631] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 300.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 128
100%|██████████| 1024/1024 [00:37<00:00, 27.63it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1024      
Failed requests:                         0         
Maximum request concurrency:             128       
Request rate configured (RPS):           300.00    
Benchmark duration (s):                  37.06     
Total input tokens:                      524288    
Total generated tokens:                  262144    
Request throughput (req/s):              27.63     
Output token throughput (tok/s):         7074.21   
Peak output token throughput (tok/s):    10880.00  
Peak concurrent requests:                256.00    
Total token throughput (tok/s):          21222.64  
---------------Time to First Token----------------
Mean TTFT (ms):                          617.87    
Median TTFT (ms):                        621.26    
P50 TTFT (ms):                           621.26    
P90 TTFT (ms):                           947.43    
P99 TTFT (ms):                           1154.81   
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.56     
Median ITL (ms):                         12.37     
P50 ITL (ms):                            12.37     
P90 ITL (ms):                            12.90     
P99 ITL (ms):                            188.78    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4600.02   
Median E2EL (ms):                        4620.14   
P50 E2EL (ms):                           4620.14   
P90 E2EL (ms):                           4828.66   
P99 E2EL (ms):                           5227.09   
==================================================